/*
function компонента для Айтема (лі з текстом + кнопкою)
За натиснення на кнопку лі зникає з екрану


1. Зробити функціональну компоненту
2. Винести в цю компоненту <li>
3. Переписати return таким чином, щоби вивести на екран все те, що ми отримуємо через props
4. Зробити коллбек в батьківського елемента, який має отримати id на вхід та видалити зі стейта елемент з таким id.
5. В компоненті ToDoItem зробити виклик коллбека і передати йому id (за натиснення на кнопку). 
*/

function ToDoItem(props) {

const clickHandler = () => {
    // маємо викликати коллбек від батьківського елмента і передати туди id поточного, щоб батьківський коллбек його видалив
}


    return (
        <li>
            {props.text}
            <button onClick={()=>{this.onClick()}}>X</button>
        </li>
    )
}


export default ToDoItem;




/* Завдання з *
Створити нову дочірню до ToDolist компоненту Header
За натиснення на ToDoItem елемент списку має підсвітитися (тоненький червоний бордер), і в Хедері має з'явитись текст з цього айтема
*/